# MemberForcesServiceData Properties

---
The MemberForcesServiceData type exposes the following members.
| Name| Description
---|---|---
| Document|  The current document.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
MemberForcesServiceData Class
Autodesk.Revit.DB.Structure Namespace